
<!-- Using the same nyc-ticket-violation dataset, let's assume that tickets can 
be dismissed if the license plate, state, and/or street name are all there
but without requiring the make of car. 
Remove rows that are missing one or more of these. 
How many rows remain? Assuming $100/ticket, how much money would the city lose as a result of this? -->

# Using the same nyc-ticket-violation dataset, let’s assume that tickets can be dismissed if the license plate, state, and/or street name are all there but without requiring the make of car. Remove rows that are missing one or more of these. How many rows remain? Assuming 100 / ticket, how much money would the city lose as a result of this?

In [14]:
import pandas as pd
df= pd.DataFrame
from matplotlib import pyplot as plt

In [15]:
df=pd.read_csv('data.csv', usecols=['Plate ID', 'Registration State', 'Street Name'])

In [16]:
df.shape

(50113, 3)

In [17]:
df.head()

  Plate ID Registration State           Street Name
0  KGK6659                 NY  WB ATLANTIC AVE @ SH
1  L5232HY                 TN   Rockaway Beach Blvd
2   BPMN76                 FL            W 113th St
3  57387MJ                 NY             W 33rd St
4   M81KFJ                 NJ  WB FOSTER AVE @ E 18

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50113 entries, 0 to 50112
Data columns (total 3 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Plate ID            50000 non-null  object
 1   Registration State  50000 non-null  object
 2   Street Name         49990 non-null  object
dtypes: object(3)
memory usage: 1.1+ MB

In [19]:


# count rows with missing data
df.isnull().sum()

Plate ID              113
Registration State    113
Street Name           123
dtype: int64

# Question 1: Remove rows that are missing one or more of these.

In [20]:
my_null=df.dropna() # drops rows with null values

In [21]:
my_null

      Plate ID Registration State           Street Name
0      KGK6659                 NY  WB ATLANTIC AVE @ SH
1      L5232HY                 TN   Rockaway Beach Blvd
2       BPMN76                 FL            W 113th St
3      57387MJ                 NY             W 33rd St
4       M81KFJ                 NJ  WB FOSTER AVE @ E 18
...        ...                ...                   ...
49995  JPN4910                 NY   EB E 125TH ST @ 2ND
49996   174ZYG                 CT             W 13th St
49997  HES6895                 NY            E 182nd St
49998  63035MN                 NY      W Kingsbridge Rd
49999  AW74165                 CT              Canal Pl

[49990 rows x 3 columns]

In [22]:
ndf=my_null.shape
print(f"Remaining Rows:", ndf)

Remaining Rows: (49990, 3)

## Question 2
### How many rows remain? Assuming 100 dollars/ticket, how much money would the city lose as a result of this? -->

In [26]:
my_null.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 49990 entries, 0 to 49999
Data columns (total 3 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Plate ID            49990 non-null  object
 1   Registration State  49990 non-null  object
 2   Street Name         49990 non-null  object
dtypes: object(3)
memory usage: 1.5+ MB

In [27]:
del_row = df.shape[0] - my_null.shape[0]

In [28]:
print(f"Deleted Rows = ", del_row )

Deleted Rows =  123

In [29]:
print(f"Revenue Lost = ", del_row * 100)

Revenue Lost =  12300